scripts/exp2/redis-rdb-09.txt
====== PING_INLINE ======
  100000 requests completed in 4.45 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.05% <= 0.1 milliseconds
1.05% <= 0.2 milliseconds
3.89% <= 0.3 milliseconds
9.36% <= 0.4 milliseconds
18.04% <= 0.5 milliseconds
27.91% <= 0.6 milliseconds
35.77% <= 0.7 milliseconds
42.13% <= 0.8 milliseconds
47.71% <= 0.9 milliseconds
52.74% <= 1.0 milliseconds
57.49% <= 1.1 milliseconds
62.03% <= 1.2 milliseconds
66.56% <= 1.3 milliseconds
71.08% <= 1.4 milliseconds
74.72% <= 1.5 milliseconds
77.10% <= 1.6 milliseconds
78.96% <= 1.7 milliseconds
80.53% <= 1.8 milliseconds
81.86% <= 1.9 milliseconds
83.01% <= 2.0 milliseconds
83.81% <= 2.1 milliseconds
83.81% <= 2 milliseconds
85.00% <= 4 milliseconds
85.01% <= 5 milliseconds
91.20% <= 6 milliseconds
98.57% <= 7 milliseconds
99.95% <= 9 milliseconds
99.96% <= 10 milliseconds
99.97% <= 11 milliseconds
99.99% <= 12 milliseconds
100.00% <= 12 milliseconds
22492.13 requests per second

====== PING_BULK ======
  100000 requests completed in 3.84 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

63.37% <= 1 milliseconds
88.69% <= 2 milliseconds
90.00% <= 5 milliseconds
94.15% <= 6 milliseconds
99.12% <= 7 milliseconds
100.00% <= 8 milliseconds
26055.24 requests per second

====== SET ======
  100000 requests completed in 2.66 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.71% <= 1 milliseconds
99.51% <= 2 milliseconds
99.94% <= 3 milliseconds
99.98% <= 4 milliseconds
100.00% <= 5 milliseconds
100.00% <= 6 milliseconds
37636.43 requests per second

====== GET ======
  100000 requests completed in 2.61 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.93% <= 1 milliseconds
100.00% <= 1 milliseconds
38284.84 requests per second

====== INCR ======
  100000 requests completed in 2.65 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.51% <= 1 milliseconds
99.35% <= 2 milliseconds
99.89% <= 3 milliseconds
99.95% <= 4 milliseconds
99.99% <= 5 milliseconds
100.00% <= 5 milliseconds
37664.79 requests per second

====== LPUSH ======
  100000 requests completed in 2.67 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.01% <= 1 milliseconds
99.37% <= 2 milliseconds
100.00% <= 4 milliseconds
37495.31 requests per second

====== RPUSH ======
  100000 requests completed in 2.66 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.26% <= 1 milliseconds
99.21% <= 2 milliseconds
99.91% <= 3 milliseconds
99.98% <= 4 milliseconds
99.99% <= 5 milliseconds
100.00% <= 5 milliseconds
37537.54 requests per second

====== LPOP ======
  100000 requests completed in 2.67 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.43% <= 1 milliseconds
99.43% <= 2 milliseconds
99.90% <= 3 milliseconds
99.94% <= 4 milliseconds
99.98% <= 5 milliseconds
100.00% <= 5 milliseconds
37481.26 requests per second

====== RPOP ======
  100000 requests completed in 2.70 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

97.32% <= 1 milliseconds
99.35% <= 2 milliseconds
99.89% <= 3 milliseconds
100.00% <= 3 milliseconds
37091.99 requests per second

====== SADD ======
  100000 requests completed in 2.91 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

97.06% <= 1 milliseconds
99.89% <= 2 milliseconds
99.93% <= 3 milliseconds
99.96% <= 4 milliseconds
99.99% <= 5 milliseconds
100.00% <= 6 milliseconds
34376.07 requests per second

====== HSET ======
  100000 requests completed in 2.79 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

94.99% <= 1 milliseconds
99.15% <= 2 milliseconds
99.76% <= 3 milliseconds
100.00% <= 3 milliseconds
35842.29 requests per second

====== SPOP ======
  100000 requests completed in 2.62 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.78% <= 1 milliseconds
99.86% <= 2 milliseconds
99.93% <= 3 milliseconds
99.97% <= 4 milliseconds
100.00% <= 4 milliseconds
38240.92 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 2.66 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.51% <= 1 milliseconds
99.46% <= 2 milliseconds
99.99% <= 3 milliseconds
100.00% <= 3 milliseconds
37565.74 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 3.25 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

95.36% <= 1 milliseconds
99.89% <= 2 milliseconds
99.91% <= 3 milliseconds
99.93% <= 4 milliseconds
99.95% <= 5 milliseconds
99.97% <= 6 milliseconds
99.99% <= 7 milliseconds
100.00% <= 7 milliseconds
30797.66 requests per second

====== LRANGE_300 (first 300 elements) ======
  100000 requests completed in 5.37 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
99.38% <= 2 milliseconds
99.90% <= 3 milliseconds
99.95% <= 4 milliseconds
99.96% <= 5 milliseconds
99.99% <= 6 milliseconds
100.00% <= 7 milliseconds
18625.44 requests per second

====== LRANGE_500 (first 450 elements) ======
  100000 requests completed in 6.97 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
99.19% <= 2 milliseconds
99.94% <= 3 milliseconds
99.95% <= 4 milliseconds
99.96% <= 5 milliseconds
99.97% <= 6 milliseconds
99.99% <= 7 milliseconds
100.00% <= 7 milliseconds
14353.38 requests per second

====== LRANGE_600 (first 600 elements) ======
  100000 requests completed in 7.87 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
64.79% <= 2 milliseconds
99.85% <= 3 milliseconds
99.91% <= 4 milliseconds
99.94% <= 5 milliseconds
99.96% <= 6 milliseconds
99.99% <= 7 milliseconds
100.00% <= 7 milliseconds
12703.25 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 2.92 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

87.73% <= 1 milliseconds
99.22% <= 2 milliseconds
99.81% <= 3 milliseconds
99.92% <= 4 milliseconds
99.98% <= 5 milliseconds
99.99% <= 6 milliseconds
99.99% <= 7 milliseconds
100.00% <= 9 milliseconds
34258.31 requests per second